# აქ მაქ ცვლადები და როდესაც type ფუნქციას ვიყენებ გამოაქვს მონაცემის ტიპს
# შემდეგ დავპრინტე და გამოიყვანა3 სხვადასხვა მონაცემთა ტიპი
word = "GOA"
number = 100
float = 100.5

print(type(word))
print(type(number))
print(type(float))
# აქ უადვილესს კალკულაციის მეთოდს ვიყენებ მაგრამ არ გაქვს თაავისუფლება რათა
# რა რიცხვიც გინდა ჩაწერო
first = 10
second = 4
print(first / second)
# ხოლო მეორეში input ის ფუნქციამაქ გამოყენებული და რა რიცხვიც გინდა ჩაწერ და
# გამოიტანს კალკულაციასს
# or
# აქ მე მაქ გამოყენებული int და input რომელიც int ათწილადებს უშვებს
# და input კი გვეხმარება რათა გამოვიძახოთ ან შევინახოთ მონაცემები
# როდესაც ცვლადი დავადეკლარირე მე ამას ვპრინტავ და გაყოფის ნიშანს ვიყენებ
number1 = int(input("შეიყვანეთ რიცხვი:"))
number2 = int(input("შეიყვანეთ მეორე რიცხვი:"))

print(number1 / number2)